Table of Contents
 Class Member2D
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Representation of member2D
[OpenModelClass("CI.StructModel.Structure.Member2D,CI.StructuralElements", "CI.StructModel.Structure.IMember2D,CI.BasicTypes")]
public class Member2D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Member2D
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Member2D()
Constructor
public Member2D()
Properties
 Elements2D
Array of element2D
public List<ReferenceElement> Elements2D { get; set; }
Property Value
List<ReferenceElement>
List of Element2D
 Members1D
Array of internal members, ribs
public List<ReferenceElement> Members1D { get; set; }
Property Value
List<ReferenceElement>
 Name
Name of Member
public string Name { get; set; }
Property Value
string
 Edit this page